import {sidebar} from "vuepress-theme-hope";

export default sidebar({
    "/": [
        "",
        {
            text: "项目管理",
            collapsible: true,
            prefix: "/posts/项目管理/",
            children: [
                {text: "目录", link: "0-目录"},
                {
                    text: "流程管理",
                    collapsible: true,
                    prefix: "/posts/项目管理/01-流程管理",
                    children: [
                        {text: "项目规划", link: "1-项目规划"},
                        {text: "敏捷方法", link: "2-敏捷方法"},
                        {text: "风险管理", link: "3-风险管理"},
                        {text: "依赖管理", link: "4-依赖管理"},
                        {text: "里程碑管理", link: "5-里程碑管理"},
                        {text: "范围管理", link: "6-范围管理"},
                        {text: "时间估算", link: "7-时间估算"},
                        {text: "执行与交付", link: "8-执行与交付"},
                    ]
                },
                {
                    text: "技术领导力",
                    collapsible: true,
                    prefix: "/posts/项目管理/02-技术领导力",
                    children: [
                        {text: "架构决策", link: "01-架构决策"},
                        {text: "系统监控与性能", link: "02-系统监控与性能"},
                        {text: "基础设施扩展", link: "03-基础设施扩展"},
                        {text: "技术债务管理", link: "04-技术债务管理"},
                        {text: "技术路线规划", link: "05-技术路线规划"},
                        {text: "构建 vs 购买评估", link: "06-构建 vs 购买评估"},
                        {text: "技术风险评估", link: "07-技术风险评估"},
                        {text: "安全与测试策略", link: "08-安全与测试策略"},
                        {text: "CI/CD 实施与发布流程", link: "09-CICD 实施与发布流程"},
                    ]
                },
                {
                    text: "团队与人员管理",
                    collapsible: true,
                    prefix: "/posts/项目管理/03-团队与人员管理",
                    children: [
                        {text: "招聘与团队结构", link: "1-招聘与团队结构"},
                        {text: "绩效评估", link: "2-绩效评估"},
                        {text: "指导与辅导", link: "3-指导与辅导"},
                        {text: "职业发展规划", link: "4-职业发展规划"},
                        {text: "团队授权与任务分配", link: "5-团队授权与任务分配"},
                        {text: "冲突解决与反馈", link: "6-冲突解决与反馈"},
                        {text: "团队激励与信任建立", link: "7-团队激励与信任建立"},
                        {text: "一对一会议与团队会议", link: "8-一对一会议与团队会议"},
                    ]
                },
                {
                    text: "质量与流程",
                    collapsible: true,
                    prefix: "/posts/项目管理/04-质量与流程",
                    children: [
                        {text: "事件管理", link: "1-事件管理"},
                        {text: "测试策略", link: "2-测试策略"},
                        {text: "代码评审最佳实践", link: "3-代码评审最佳实践"},
                        {text: "文档与标准", link: "4-文档与标准"},
                        {text: "持续改进与流程优化", link: "5-持续改进与流程优化"},
                    ]
                },
                {
                    text: "业务洞察",
                    collapsible: true,
                    prefix: "/posts/项目管理/05-业务洞察",
                    children: [
                        {text: "产品战略对齐", link: "1-产品战略对齐"},
                        {text: "投资回报分析", link: "2-投资回报分析"},
                        {text: "市场与竞争分析", link: "3-市场与竞争分析"},
                        {text: "预算与成本优化", link: "4-预算与成本优化"},
                        {text: "供应商管理", link: "5-供应商管理"},
                    ]
                },
                {
                    text: "沟通与协作",
                    collapsible: true,
                    prefix: "/posts/项目管理/06-沟通与协作",
                    children: [
                        {text: "利益相关者管理", link: "1-利益相关者管理"},
                        {text: "跨部门协作", link: "2-跨部门协作"},
                        {text: "高层沟通与报告", link: "3-高层沟通与报告"},
                        {text: "客户反馈与关系管理", link: "4-客户反馈与关系管理"},
                        {text: "合作伙伴与技术集成", link: "5-合作伙伴与技术集成"},
                    ]
                },
                {
                    text: "工程文化",
                    collapsible: true,
                    prefix: "/posts/项目管理/07-工程文化",
                    children: [
                        {text: "团队文化建设", link: "1-团队文化建设"},
                        {text: "包容性环境", link: "2-包容性环境"},
                        {text: "学习与知识分享", link: "3-学习与知识分享"},
                        {text: "无责后检", link: "4-无责后检"},
                        {text: "创新与持续改进", link: "5-创新与持续改进"},
                    ]
                },
                {
                    text: "变更管理",
                    collapsible: true,
                    prefix: "/posts/项目管理/08-变更管理",
                    children: [
                        {text: "技术变更", link: "1-技术变更"},
                        {text: "组织变革", link: "2-组织变革"},
                        {text: "团队重组", link: "3-团队重组"},
                        {text: "工具与流程迁移", link: "4-工具与流程迁移"},
                    ]
                },
                {
                    text: "危机与应急管理",
                    collapsible: true,
                    prefix: "/posts/项目管理/09-危机与应急管理",
                    children: [
                        {text: "紧急应对与战情室", link: "1-紧急应对与战情室"},
                        {text: "事件响应与服务恢复", link: "2-事件响应与服务恢复"},
                        {text: "灾难恢复与业务连续性", link: "3-灾难恢复与业务连续性"},
                        {text: "安全事件处理", link: "4-安全事件处理"},
                    ]
                },
                {
                    text: "知识与文档管理",
                    collapsible: true,
                    prefix: "/posts/项目管理/10-知识与文档管理",
                    children: [
                        {text: "架构与流程文档", link: "1-架构与流程文档"},
                        {text: "经验总结与最佳实践", link: "2-经验总结与最佳实践"},
                        {text: "知识库与分享活动", link: "3-知识库与分享活动"},
                        {text: "变更记录与决策文档", link: "4-变更记录与决策文档"},
                    ]
                },
            ],
        },
        {
            text: "从0开始学架构",
            collapsible: true,
            prefix: "/posts/从0开始学架构/",
            children: [
                {
                    text: "开篇词",
                    collapsible: true,
                    prefix: "/posts/从0开始学架构/01-开篇词/",
                    children: [
                        {text: "照着做，你也能成为架构师！", link: "01-照着做，你也能成为架构师！"},
                    ]
                },
                {
                    text: "基础架构",
                    collapsible: true,
                    prefix: "/posts/从0开始学架构/02-基础架构/",
                    children: [
                        {text: "架构到底是指什么？", link: "01-架构到底是指什么？"},
                        {text: "架构设计的历史背景", link: "02-架构设计的历史背景"},
                        {text: "架构设计的目的", link: "03-架构设计的目的"},
                        {text: "复杂度来源：高性能", link: "04丨复杂度来源：高性能"},
                        {text: "复杂度来源：高可用", link: "05丨复杂度来源：高可用"},
                        {text: "复杂度来源：可扩展性", link: "06丨复杂度来源：可扩展性"},
                        {text: "复杂度来源：低成本、安全、规模", link: "07丨复杂度来源：低成本、安全、规模"},
                        {text: "架构设计三原则", link: "08丨架构设计三原则"},
                        {text: "架构设计原则案例", link: "09丨架构设计原则案例"},
                        {text: "架构设计流程：识别复杂度", link: "10丨架构设计流程：识别复杂度"},
                        {text: "架构设计流程：设计备选方案", link: "11丨架构设计流程：设计备选方案"},
                        {text: "架构设计流程：评估和选择备选方案", link: "12丨架构设计流程：评估和选择备选方案"},
                        {text: "架构设计流程：详细方案设计", link: "13丨架构设计流程：详细方案设计"},
                    ]
                },
                {
                    text: "高性能架构模式",
                    collapsible: true,
                    prefix: "/posts/从0开始学架构/03-高性能架构模式/",
                    children: [
                        {text: "高性能数据库集群：读写分离", link: "14丨高性能数据库集群：读写分离"},
                        {text: "高性能数据库集群：分库分表", link: "15丨高性能数据库集群：分库分表"},
                        {text: "高性能NoSQL", link: "16丨高性能NoSQL"},
                        {text: "高性能缓存架构", link: "17丨高性能缓存架构"},
                        {text: "单服务器高性能模式：PPC与TPC", link: "18丨单服务器高性能模式：PPC与TPC"},
                        {text: "单服务器高性能模式：Reactor与Proactor", link: "19丨单服务器高性能模式：Reactor与Proactor"},
                        {text: "高性能负载均衡：分类及架构", link: "20丨高性能负载均衡：分类及架构"},
                        {text: "高性能负载均衡：算法", link: "21丨高性能负载均衡：算法"},
                    ]
                },
                {
                    text: "高可用架构模式",
                    collapsible: true,
                    prefix: "/posts/从0开始学架构/04-高可用架构模式/",
                    children: [
                        {text: "想成为架构师，你必须知道CAP理论", link: "22丨想成为架构师，你必须知道CAP理论"},
                        {text: "想成为架构师，你必须掌握的CAP细节", link: "23丨想成为架构师，你必须掌握的CAP细节"},
                        {text: "FMEA方法，排除架构可用性隐患的利器", link: "24丨FMEA方法，排除架构可用性隐患的利器"},
                        {text: "高可用存储架构：双机架构", link: "25丨高可用存储架构：双机架构"},
                        {text: "高可用存储架构：集群和分区", link: "26丨高可用存储架构：集群和分区"},
                        {text: "如何设计计算高可用架构？", link: "27丨如何设计计算高可用架构？"},
                        {text: "业务高可用的保障：异地多活架构", link: "28丨业务高可用的保障：异地多活架构"},
                        {text: "异地多活设计4大技巧", link: "29丨异地多活设计4大技巧"},
                        {text: "异地多活设计4步走", link: "30丨异地多活设计4步走"},
                        {text: "如何应对接口级的故障？", link: "31丨如何应对接口级的故障？"},
                    ]
                },
                {
                    text: "可扩展架构模式",
                    collapsible: true,
                    prefix: "/posts/从0开始学架构/05-可扩展架构模式/",
                    children: [
                        {text: "可扩展架构的基本思想和模式", link: "32丨可扩展架构的基本思想和模式"},
                        {text: "传统的可扩展架构模式：分层架构和SOA", link: "33丨传统的可扩展架构模式：分层架构和SOA"},
                        {text: "深入理解微服务架构：银弹or焦油坑？", link: "34丨深入理解微服务架构：银弹or焦油坑？"},
                        {text: "微服务架构最佳实践-方法篇", link: "35丨微服务架构最佳实践-方法篇"},
                        {text: "微服务架构最佳实践-基础设施篇", link: "36丨微服务架构最佳实践-基础设施篇"},
                        {text: "微内核架构详解", link: "37丨微内核架构详解"},
                    ]
                },
                {
                    text: "架构实战",
                    collapsible: true,
                    prefix: "/posts/从0开始学架构/06-架构实战/",
                    children: [
                        {text: "架构师应该如何判断技术演进的方向？", link: "38丨架构师应该如何判断技术演进的方向？"},
                        {text: "互联网技术演进的模式", link: "39丨互联网技术演进的模式"},
                        {text: "互联网架构模板：“存储层”技术", link: "40丨互联网架构模板：“存储层”技术"},
                        {text: "互联网架构模板：“开发层”和“服务层”技术", link: "41丨互联网架构模板：“开发层”和“服务层”技术"},
                        {text: "互联网架构模板：“网络层”技术", link: "42丨互联网架构模板：“网络层”技术"},
                        {text: "互联网架构模板：“用户层”和“业务层”技术", link: "43丨互联网架构模板：“用户层”和“业务层”技术"},
                        {text: "互联网架构模板：“平台”技术", link: "44丨互联网架构模板：“平台”技术"},
                        {text: "架构重构内功心法第一式：有的放矢", link: "45丨架构重构内功心法第一式：有的放矢"},
                        {text: "架构重构内功心法第二式：合纵连横", link: "46丨架构重构内功心法第二式：合纵连横"},
                        {text: "架构重构内功心法第三式：运筹帷幄", link: "47丨架构重构内功心法第三式：运筹帷幄"},
                        {text: "再谈开源项目：如何选择、使用以及二次开发？", link: "48丨再谈开源项目：如何选择、使用以及二次开发？"},
                        {text: "谈谈App架构的演进", link: "49丨谈谈App架构的演进"},
                        {text: "架构实战：架构设计文档模板", link: "50丨架构实战：架构设计文档模板"},
                    ]
                },
                {
                    text: "特别放送",
                    collapsible: true,
                    prefix: "/posts/从0开始学架构/07-特别放送/",
                    children: [
                        {text: "新书首发丨《从零开始学架构》", link: "新书首发丨《从零开始学架构》"},
                        {text: "致「从0开始学架构」专栏订阅用户", link: "致「从0开始学架构」专栏订阅用户"},
                        {text: '架构专栏特别放送丨"华仔，放学别走！"第1期', link: '架构专栏特别放送丨"华仔，放学别走！"第1期'},
                        {text: '架构专栏特别放送丨"华仔，放学别走！"第2期', link: '架构专栏特别放送丨"华仔，放学别走！"第2期'},
                        {text: '如何高效地学习开源项目丨"华仔，放学别走！"第3期', link: '如何高效地学习开源项目丨"华仔，放学别走！"第3期'},
                        {text: '架构师成长之路丨"华仔，放学别走！"第4期', link: '架构师成长之路丨"华仔，放学别走！"第4期'},
                        {text: '架构师必读书单丨"华仔，放学别走！"第5期', link: '架构师必读书单丨"华仔，放学别走！"第5期'},
                    ]
                },
                {
                    text: "结束语",
                    collapsible: true,
                    prefix: "/posts/从0开始学架构/08-结束语/",
                    children: [
                        {text: "坚持，成就你的技术梦想", link: "结束语丨坚持，成就你的技术梦想"},
                    ]
                },
            ],
        },
    ],
});
